searly4/seLib/src/Core_Exp/seLib/NRF52_BLE_Module.cpp
/*
   Copyright 2018 by Scott Early

   Licensed under the Apache License, Version 2.0 (the "License");
   you may not use this file except in compliance with the License.
   You may obtain a copy of the License at

       http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing, software
   distributed under the License is distributed on an "AS IS" BASIS,
   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
   See the License for the specific language governing permissions and
   limitations under the License.
*/

#ifdef SELIB_USE_CONFIG
#include <seLib_Config.h>
#endif

#if defined(EnableModule_BLE) && defined(__NRF52)

#include "seLib/experimental/NRF52_BLE_Module.h"
//#include "IDC_NRF52.h"

#include <stdint.h>
#include <string.h>
#include <assert.h>

extern "C" {
#include <nrf_pwr_mgmt.h> // header lacks extern "C" wrapper
}

#include <nordic_common.h>
#include <nrf.h>
#include <app_timer.h>
#include <app_uart.h>
#include <app_util_platform.h>
#include <ble_hci.h>
#include <ble_advdata.h>
#include <ble_advertising.h>
#include <ble_conn_params.h>
#include <nrf_sdh.h>
#include <nrf_sdh_soc.h>
#include <nrf_sdh_ble.h>
#include <nrf_ble_gatt.h>
#include <ble_gap.h>

#include <ble_dis.h>
#if NRF_MODULE_ENABLED(BLE_DFU)
#include <ble_dfu.h>
#endif
//#include <nrf_ble_dfu.h>
//#include <ble_nus.h>
#include <nrf_power.h>
#include <nrf_bootloader_info.h>

#include <nrf_log.h>
#include <nrf_log_ctrl.h>
#include <nrf_log_default_backends.h>

#include <seLib/experimental/seLib_Util.h>
//#include "Series301_BLEService.h"


namespace seLib {
namespace BLE_Module {

namespace BLE_Peripheral_Handlers {
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt);
static void on_adv_evt(ble_adv_evt_t ble_adv_evt);
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt);
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context);
static void conn_params_error_handler(uint32_t nrf_error);
}

#define APP_BLE_CONN_CFG_TAG            1                                           /**< A tag identifying the SoftDevice BLE configuration. */

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#ifdef BLE_DFU_APP_SUPPORT
static ble_dfu_t                            m_dfus;                                    /**< Structure used to identify the DFU service. */
#endif // BLE_DFU_APP_SUPPORT

//BLE_NUS_DEF(m_nus);                                                                 /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

//static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
//static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */

static bool m_memory_access_in_progress = false;       /**< Flag to keep track of ongoing operations on persistent memory. */

BLE_Peripheral_Def_Base_t const * BLE_Active_Peripheral = nullptr;

namespace BLE_Peripheral_Handlers {

/**
 @fn	void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)

 @brief	Function for handling events from the GATT library.

 @author	Searly
 @date	5/11/2018

 @param [in,out]	p_gatt	If non-null, the gatt.
 @param 			p_evt 	The event.
 */
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt) {
	if ((BLE_Active_Peripheral->GetState()->conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)) {
		#if BLE_NUS_ENABLED==1
		m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
		NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
		#endif
	}

	NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x", p_gatt->att_mtu_desired_central, p_gatt->att_mtu_desired_periph);
}


/**
 @fn	static void on_adv_evt(ble_adv_evt_t ble_adv_evt)

 @brief	This function will be called for advertising events which are passed to the application.

 @author	Searly
 @date	5/11/2018

 @param	ble_adv_evt	The ble advance event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt) {
	uint32_t err_code;

	switch (ble_adv_evt) {
		case BLE_ADV_EVT_FAST:
			//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
			//APP_ERROR_CHECK(err_code);
			break;
			
		case BLE_ADV_EVT_IDLE:
			seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_ADV_EVT_IDLE");
			BLE_Active_Peripheral->on_adv_timeout();
		    //sleep_mode_enter(); // todo: any action needed?
			break;
			
		default:
			break;
	}
}


/**
 @fn	static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)

 @brief	Function for handling BLE events.

