searly4/seLib/src/Core_Exp/seLib/NRF52_BLE_Module.cpp
 @author	Searly
 @date	5/11/2018

 @param 			p_ble_evt	The ble event.
 @param [in,out]	p_context	If non-null, the context.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context) {
	BLE_Active_Peripheral->on_ble_evt(p_ble_evt);
}


/**
 @fn	static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)

 @brief	This function will be called for all events in the Connection Parameters Module which are passed to the application.

 @note	All this function does is to disconnect. This could have been
 		done by simply setting the disconnect_on_fail config parameter, but instead we use the
 		event handler mechanism to demonstrate its use.

 @author	Searly
 @date	5/11/2018

 @param	p_evt	A variable-length parameters list containing event.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt) {
	uint32_t err_code;

	if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
		err_code = sd_ble_gap_disconnect(BLE_Active_Peripheral->GetState()->conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
		APP_ERROR_CHECK(err_code);
	}
}


/**
 @fn	static void conn_params_error_handler(uint32_t nrf_error)

 @brief	Function for handling errors from the Connection Parameters module.

 @author	Searly
 @date	5/11/2018

 @param	nrf_error	The nrf error.
 */
static void conn_params_error_handler(uint32_t nrf_error) {
	APP_ERROR_HANDLER(nrf_error);
}

// This function will process the data received from the Nordic UART BLE Service and send it to the UART module.
#if NRF_MODULE_ENABLED(BLE_NUS)
static void nus_data_handler(ble_nus_evt_t * p_evt) {

	if (p_evt->type == BLE_NUS_EVT_RX_DATA) {
		uint32_t err_code;

		NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
		NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

		for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++) {
			do {
				err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
				if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY)) {
					NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
					APP_ERROR_CHECK(err_code);
				}
			} while (err_code == NRF_ERROR_BUSY);
		}

		if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r') {
			while (app_uart_put('\n') == NRF_ERROR_BUSY);
		}
	}

}
#endif



static void buttonless_dfu_sdh_state_observer(nrf_sdh_state_evt_t state, void * p_context) {
    if (state == NRF_SDH_EVT_STATE_DISABLED) {
        // Softdevice was disabled before going into reset. Inform bootloader to skip CRC on next boot.
        //nrf_power_gpregret2_set(BOOTLOADER_DFU_SKIP_CRC);

        //Go to system off.
        nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
    }
}

/* nrf_sdh state observer. */
NRF_SDH_STATE_OBSERVER(m_buttonless_dfu_state_obs, 0) = {
    .handler = buttonless_dfu_sdh_state_observer,
};

// YOUR_JOB: Update this code if you want to do anything given a DFU event (optional).
/**@brief Function for handling dfu events from the Buttonless Secure DFU service
 *
 * @param[in]   event   Event from the Buttonless Secure DFU service.
 */
#if NRF_MODULE_ENABLED(BLE_DFU)
static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event) {
    switch (event) {
        case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
            NRF_LOG_INFO("Device is preparing to enter bootloader mode.");
            // YOUR_JOB: Disconnect all bonded devices that currently are connected.
            //           This is required to receive a service changed indication
            //           on bootup after a successful (or aborted) Device Firmware Update.
            break;

        case BLE_DFU_EVT_BOOTLOADER_ENTER:
            // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
            //           by delaying reset by reporting false in app_shutdown_handler
            NRF_LOG_INFO("Device will enter bootloader mode.");
            break;

        case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
            NRF_LOG_ERROR("Request to enter bootloader mode failed asynchroneously.");
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
            break;

        case BLE_DFU_EVT_RESPONSE_SEND_ERROR:
            NRF_LOG_ERROR("Request to send a response to client failed.");
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
            APP_ERROR_CHECK(false);
            break;

        default:
            NRF_LOG_ERROR("Unknown event from ble_dfu_buttonless.");
            break;
    }
}
#endif

}

// ** BLE_Peripheral_Def_t ***************************************************************
#pragma region

//BLE_Peripheral_Def_t const * BLE_Peripheral_State_t::ActiveDef = nullptr;


uint32_t BLE_Peripheral_Def_Base_t::InitService(const BLE_Service_Def_Base_t& service_def) const {
	seLib_Trace(TraceVal_EnterFunction, (void*)&__FUNCTION__, nullptr);
	uint32_t       err_code;
	auto& svc_state = *service_def.GetState();

	uint8_t uuid_type = BLE_UUID_TYPE_VENDOR_BEGIN;
	// Add custom base UUID
	err_code = sd_ble_uuid_vs_add(base_uuid, &uuid_type);
	if (err_code != NRF_SUCCESS) {
		APP_ERROR_CHECK(err_code);
		return err_code;
	}

	err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &service_def.uuid, &svc_state.service_handle);
	APP_ERROR_CHECK(err_code);
	if (err_code != NRF_SUCCESS)
		return err_code;

	for (size_t i = 0; i < service_def.CharacteristicCount; i++) {
		err_code = service_def.AddCharacteristic(i);
		//mimicmotion_char_add(&MM_BLE_CharHandles[i], &MM_BLE_CharData[i]);
		if (err_code != NRF_SUCCESS) {
			seLib_Trace2(TraceVal_Error, (void*)&__FUNCTION__, nullptr, (uint8_t)i);
			return err_code;
		}
	}

	service_def.Init();
}


/**
 @fn	void BLE_Peripheral_Def_t::Init() const

 @brief	Initializes this object

 @author	Searly
 @date	5/11/2018
 */
void BLE_Peripheral_Def_Base_t::Init() const {
	seLib_Trace(TraceVal_EnterFunction, (void*)&__FUNCTION__, nullptr);

	ret_code_t err_code;
	ble_stack_init();
    //peer_manager_init(erase_bonds);
	gap_params_init();

	// init gatt library
	err_code = nrf_ble_gatt_init(&m_gatt, BLE_Peripheral_Handlers::gatt_evt_handler);
	APP_ERROR_CHECK(err_code);
	//err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, 64);
	//APP_ERROR_CHECK(err_code);

	// Add custom base UUID
	/*err_code = sd_ble_uuid_vs_add(&nus_base_uuid, &uuid_type);
	if (err_code != NRF_SUCCESS) {
		return err_code;
	}*/

	services_init(); // init standard services

	// init each custom service
	assert(ServiceCount == 0 || ServiceList != nullptr);
	for (size_t i = 0; i < ServiceCount; i++) {
		const auto& service_def = ServiceList[i];
		InitService(*service_def);
	}

	advertising_init();
	conn_params_init();
}

uint32_t BLE_Peripheral_Def_Base_t::UpdateChar(BLE_Service_Def_Base_t const * service, BLE_Characteristic_t const * characteristic, uint8_t const * value, uint8_t length) const {
	uint32_t err_code;
	auto state = GetState();

	// Send value if connected and notifying
	if (state->conn_handle == BLE_CONN_HANDLE_INVALID)
		return NRF_ERROR_INVALID_STATE;

	uint8_t char_index = (uint8_t)(characteristic - service->CharacteristicList);;
	assert(char_index < service->CharacteristicCount);

	uint16_t hvx_len = length;
	ble_gatts_hvx_params_t hvx_params = { 0 };

	hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
	hvx_params.offset = 0;
	hvx_params.p_len  = &hvx_len;
	hvx_params.p_data = (characteristic->Stack) ? const_cast<uint8_t*>((const uint8_t*)value) : nullptr;
	hvx_params.handle = service->GetState()->characteristic_handles[char_index].value_handle;

