searly4/seLib/src/Core_Exp/seLib/NRF52_BLE_Module.cpp
	err_code = sd_ble_gatts_hvx(state->conn_handle, &hvx_params);
	if ((err_code == NRF_SUCCESS) && (hvx_len != length))
		err_code = NRF_ERROR_DATA_SIZE;

	if (err_code == BLE_GATTS_EVT_SYS_ATTR_MISSING) {
		err_code = sd_ble_gatts_sys_attr_set(state->conn_handle, NULL, 0, 0);
		return err_code;
	}

	if (err_code == NRF_ERROR_INVALID_STATE) {
		return err_code;
	} else if (err_code == NRF_ERROR_RESOURCES) {
		return err_code;
	} else if (err_code != NRF_SUCCESS) {
		APP_ERROR_CHECK(err_code);
		return err_code;
	}

	return NRF_SUCCESS;
}



/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
void BLE_Peripheral_Def_Base_t::gap_params_init(void) const {
	uint32_t                err_code;
	ble_gap_conn_params_t   gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *) DeviceName, strlen((const char*) DeviceName));
	APP_ERROR_CHECK(err_code);

	memset(&gap_conn_params, 0, sizeof(gap_conn_params));

	gap_conn_params.min_conn_interval = min_conn_interval;
	gap_conn_params.max_conn_interval = max_conn_interval;
	gap_conn_params.slave_latency     = SLAVE_LATENCY;
	gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

	err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
	APP_ERROR_CHECK(err_code);
}



/**
 @fn	void BLE_Peripheral_Def_t::services_init(void) const

 @brief	Function for initializing services that will be used by the application.

 @author	Searly
 @date	5/11/2018
 */
void BLE_Peripheral_Def_Base_t::services_init(void) const {
	uint32_t       err_code;

	err_code = ble_dis_init(&seLib::BLE_Module::ble_dis_config);
	APP_ERROR_CHECK(err_code);

#ifdef BLE_DFU_APP_SUPPORT
	if (Svc_DFU_Enabled) {
		// Initialize the async SVCI interface to bootloader.
		err_code = ble_dfu_buttonless_async_svci_init();
		APP_ERROR_CHECK(err_code);

		ble_dfu_buttonless_init_t dfus_init = {0};
		dfus_init.evt_handler = BLE_Peripheral_Handlers::ble_dfu_evt_handler;
		err_code = ble_dfu_buttonless_init(&dfus_init);
		APP_ERROR_CHECK(err_code);
	}
#endif
	
#if BLE_NUS_ENABLED==1
	ble_nus_init_t nus_init;

	memset(&nus_init, 0, sizeof(nus_init));

	nus_init.data_handler = nus_data_handler;

	err_code = ble_nus_init(&m_nus, &nus_init);
	APP_ERROR_CHECK(err_code);
#endif
}



/**
 @fn	void BLE_Peripheral_Def_t::conn_params_init(void) const

 @brief	Function for initializing the Connection Parameters module.

 @author	Searly
 @date	5/11/2018
 */
void BLE_Peripheral_Def_Base_t::conn_params_init(void) const {
	uint32_t               err_code;
	ble_conn_params_init_t cp_init;

	memset(&cp_init, 0, sizeof(cp_init));

	cp_init.p_conn_params                  = NULL;
	cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
	cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
	cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
	cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
	cp_init.disconnect_on_fail             = false;
	cp_init.evt_handler                    = BLE_Peripheral_Handlers::on_conn_params_evt;
	cp_init.error_handler                  = BLE_Peripheral_Handlers::conn_params_error_handler;

	static_assert(APP_TIMER_ENABLED);
	err_code = ble_conn_params_init(&cp_init);
	APP_ERROR_CHECK(err_code);
}



/**
 @fn	void BLE_Peripheral_Def_t::ble_stack_init(void) const

 @brief	This function initializes the SoftDevice and the BLE event interrupt.

 @author	Searly
 @date	5/11/2018
 */
void BLE_Peripheral_Def_Base_t::ble_stack_init(void) const {
	ret_code_t err_code;
	uint32_t ram_start = 0;

	if (!nrf_sdh_is_enabled()) {
		err_code = nrf_sdh_enable_request();
		APP_ERROR_CHECK(err_code);
	}

	// Configure the BLE stack using the default settings.
	// Fetch the start address of the application RAM.
	err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
	APP_ERROR_CHECK(err_code);

	// Enable BLE stack.
	err_code = nrf_sdh_ble_enable(&ram_start);
	APP_ERROR_CHECK(err_code);

	// Register a handler for BLE events.
	NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, BLE_Peripheral_Handlers::ble_evt_handler, NULL);
}



/**
 @fn	void BLE_Peripheral_Def_t::advertising_init(void) const

 @brief	Function for initializing the Advertising functionality.

 @author	Searly
 @date	5/11/2018
 */
void BLE_Peripheral_Def_Base_t::advertising_init(void) const {
	uint32_t               err_code;
	ble_advertising_init_t init;

	memset(&init, 0, sizeof(init));

	init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
	init.advdata.include_appearance = false;
	init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
	//init.advdata.

	init.srdata.uuids_complete.uuid_cnt = adv_uuid_count;// sizeof(adv_uuids) / sizeof(m_adv_uuids[0]);
	init.srdata.uuids_complete.p_uuids  = (ble_uuid_t*)adv_uuids;

	init.config.ble_adv_fast_enabled  = adv_fast_enabled;
	init.config.ble_adv_fast_interval = adv_fast_interval;
	init.config.ble_adv_fast_timeout  = adv_fast_timeout;

	init.config.ble_adv_slow_enabled  = adv_slow_enabled;
	init.config.ble_adv_slow_interval = adv_slow_interval;
	init.config.ble_adv_slow_timeout  = adv_slow_timeout;
	
	init.config.ble_adv_extended_enabled = adv_extended_enabled;

	init.evt_handler = BLE_Peripheral_Handlers::on_adv_evt;

	err_code = ble_advertising_init(&m_advertising, &init);
	APP_ERROR_CHECK(err_code);

	ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

void BLE_Peripheral_Def_Base_t::on_ble_evt(ble_evt_t const * p_ble_evt) const {

	uint32_t err_code;
	auto& periph_state = *GetState();

	switch (p_ble_evt->header.evt_id) {
		case BLE_GAP_EVT_CONNECTED:
			seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_GAP_EVT_CONNECTED");
			//NRF_LOG_INFO("Connected");
			//err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
			//APP_ERROR_CHECK(err_code);
			periph_state.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
			err_code = sd_ble_gatts_sys_attr_set(periph_state.conn_handle, NULL, 0, 0);
			break;

		case BLE_GAP_EVT_DISCONNECTED:
			seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_GAP_EVT_DISCONNECTED");
			//NRF_LOG_INFO("Disconnected");
			// LED indication will be changed when advertising starts.
			periph_state.conn_handle = BLE_CONN_HANDLE_INVALID;
			break;

			#ifndef S140
		case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
			{
				NRF_LOG_DEBUG("PHY update request.");
				ble_gap_phys_t const phys =
				{
					.tx_phys = BLE_GAP_PHY_AUTO,
					.rx_phys = BLE_GAP_PHY_AUTO,
				};
				err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
				APP_ERROR_CHECK(err_code);
			} break;
			#endif

		case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
		    // Pairing not supported
			seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_GAP_EVT_SEC_PARAMS_REQUEST");
			err_code = sd_ble_gap_sec_params_reply(periph_state.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
			APP_ERROR_CHECK(err_code);
			break;

			#if !defined (S112)
		case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
			{
				ble_gap_data_length_params_t dl_params;

				// Clearing the struct will effectivly set members to @ref BLE_GAP_DATA_LENGTH_AUTO
				memset(&dl_params, 0, sizeof(ble_gap_data_length_params_t));
				err_code = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &dl_params, NULL);
				APP_ERROR_CHECK(err_code);
			} break;
			#endif //!defined (S112)
			
