searly4/seLib/src/Core_Exp/seLib/NRF52_BLE_Module.cpp
		case BLE_GAP_EVT_ADV_REPORT:
			seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_GAP_EVT_ADV_REPORT");
			if (p_ble_evt->evt.gap_evt.params.adv_report.type.scan_response)
				on_scan_resp(p_ble_evt);
			break;

		case BLE_GAP_EVT_SCAN_REQ_REPORT:
			// remote device has sent a scan request
			seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_GAP_EVT_SCAN_REQ_REPORT");
			on_scan_req(p_ble_evt);
			break;

		case BLE_GATTS_EVT_SYS_ATTR_MISSING:
		    // No system attributes have been stored.
			seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_GATTS_EVT_SYS_ATTR_MISSING");
			err_code = sd_ble_gatts_sys_attr_set(periph_state.conn_handle, NULL, 0, 0);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GATTC_EVT_TIMEOUT:
		    // Disconnect on GATT Client timeout event.
			seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_GATTC_EVT_TIMEOUT");
			err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GATTS_EVT_TIMEOUT:
		    // Disconnect on GATT Server timeout event.
			seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_GATTS_EVT_TIMEOUT");
			err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GATTS_EVT_WRITE:
			{
				seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_GATTS_EVT_WRITE");
				ble_gatts_evt_write_t const & p_evt_write = p_ble_evt->evt.gatts_evt.params.write;
				//auto& t = p_ble_evt->evt.gatts_evt.params;
				//p_evt_write.
				//p_evt_write.handle;
				//auto& wr_uuid = p_evt_write.uuid;
				//APP_ERROR_CHECK(err_code);

				// todo: identify service owning characteristic and call only that service
				for (size_t i = 0; i < ServiceCount; i++) {
					const auto& service_def = ServiceList[i];
					service_def->on_write(p_ble_evt);
				}
			}
			break;

		case BLE_EVT_USER_MEM_REQUEST:
				seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_EVT_USER_MEM_REQUEST");
			err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
			{
				seLib_Log(seLib_TraceLevel_t::TraceLevel_Verbose, "BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST");
				ble_gatts_evt_rw_authorize_request_t  req;
				ble_gatts_rw_authorize_reply_params_t auth_reply;

				req = p_ble_evt->evt.gatts_evt.params.authorize_request;

				if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID) {
					if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
					    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
					    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
					{
						if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE) {
							auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
						} else {
							auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
						}
						auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
						err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle, &auth_reply);
						APP_ERROR_CHECK(err_code);
					}
				}
			} break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

		default:
		    // No implementation needed.
			break;
	}
}

void BLE_Peripheral_Def_Base_t::on_adv_timeout() const {
	uint32_t err_code;
	if (adv_slow_enabled) {
		err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_SLOW);
		APP_ERROR_CHECK(err_code);
	}
}


#pragma endregion


#pragma region ** BLE_Service_Def_t ***************************************************************

/**
 @fn	void BLE_Service_Def_t::Init() const

 @brief	Initializes this object

 @author	Searly
 @date	5/11/2018
 */
void BLE_Service_Def_Base_t::Init() const {
}


/**
 @fn	uint32_t BLE_Service_Def_t::AddCharacteristic(const BLE_Characteristic_t* char_data) const

 @brief	Function for adding the MimicMotion test characteristic.

 @author	Searly
 @date	5/11/2018

 @param	char_data	Information describing the character.

 @return	NRF_SUCCESS on success, otherwise an error code.
 */
uint32_t BLE_Service_Def_Base_t::AddCharacteristic(uint8_t charindex) const {
	const BLE_Characteristic_t* char_data = &CharacteristicList[charindex];
	uint32_t   err_code;
	ble_gatts_attr_md_t     cccd_md = { 0 };
	ble_gatts_char_md_t     char_md = { 0 };
	ble_gatts_attr_t        attr_char_value = { 0 };
	ble_uuid_t              ble_uuid;
	ble_gatts_attr_md_t     attr_md = { 0 };
	//ble_gatts_char_pf_t     char_pf;

	cccd_md.vloc = BLE_GATTS_VLOC_STACK;
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);

	char_md.char_props.read     = (char_data->Read) ? 1 : 0;
	char_md.char_props.write    = (char_data->Write) ? 1 : 0;
	char_md.char_props.notify   = (char_data->Notify) ? 1 : 0;
	char_md.p_char_user_desc    = const_cast<uint8_t*>(char_data->Description); // API erroneously uses non-const
	char_md.char_user_desc_size = (char_data->Description != 0) ? strlen((const char*)char_data->Description) : 0;
	char_md.char_user_desc_max_size = char_md.char_user_desc_size;
	char_md.p_char_pf = char_data->PresentationFormat;

	//char_pf.
	//char_md.p_char_pf           = char_pf;
	char_md.p_user_desc_md      = NULL;
	char_md.p_cccd_md           = &cccd_md;
	char_md.p_sccd_md           = NULL;

	ble_uuid.type = BLE_UUID_TYPE_VENDOR_BEGIN;
	ble_uuid.uuid = char_data->UUID;

	attr_md.vloc       = (char_data->Stack) ? BLE_GATTS_VLOC_STACK : BLE_GATTS_VLOC_USER;
	attr_md.rd_auth    = 0;
	attr_md.wr_auth    = 0;
	attr_md.vlen       = 1;
	if (char_data->Read)    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
	else                    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&attr_md.read_perm);
	if (char_data->Write)   BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
	else                    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&attr_md.write_perm);


	attr_char_value.p_uuid    = &ble_uuid;
	attr_char_value.p_attr_md = &attr_md;
	attr_char_value.init_len  = char_data->InitialLength;
	attr_char_value.init_offs = 0;
	attr_char_value.max_len   = char_data->MaxLength;
	attr_char_value.p_value   = char_data->Buffer;

	err_code = sd_ble_gatts_characteristic_add(GetState()->service_handle, &char_md, &attr_char_value, &(GetState()->characteristic_handles[charindex]));
	if (err_code != NRF_SUCCESS)
		return err_code;
	if (char_data->Notify) {
		err_code = sd_ble_gatts_sys_attr_set(GetState()->characteristic_handles[charindex].cccd_handle, nullptr, 0, 0);
		//APP_ERROR_CHECK(err_code);
	}

	return NRF_SUCCESS;
}


/**
 @fn	uint32_t BLE_Service_Def_t::Send(const uint8_t* data, uint8_t datalen, uint8_t charindex) const

 @brief	Send this message

