searly4/seLib/src/Core_Exp/seLib/NRF52_BLE_Module.cpp
 @author	Searly
 @date	5/11/2018

 @param	data	 	The data.
 @param	datalen  	The datalen.
 @param	charindex	The charindex.

 @return	An uint32_t.
 */
uint32_t BLE_Service_Def_Base_t::Send(const uint8_t* data, uint8_t datalen, uint8_t charindex) const {
	uint32_t err_code;

	auto& conn_handle = BLE_Active_Peripheral->GetState()->conn_handle;
	
	// Send value if connected and notifying
	if (conn_handle == BLE_CONN_HANDLE_INVALID)
		return NRF_ERROR_INVALID_STATE;

	uint16_t                len;
	uint16_t                hvx_len;
	ble_gatts_hvx_params_t  hvx_params;
	uint8_t                 char_index;

	memset(&hvx_params, 0, sizeof(hvx_params));

	hvx_params.handle = GetState()->characteristic_handles[charindex].value_handle;
	if (hvx_params.handle == 0)
		return NRF_ERROR_INVALID_STATE;

	hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
	hvx_params.offset = 0;
	hvx_params.p_len  = &hvx_len;
	hvx_params.p_data = NULL;

	len = datalen;
	hvx_len = len;

	hvx_params.p_data = const_cast<uint8_t*>(data);
	err_code = sd_ble_gatts_hvx(conn_handle, &hvx_params);
	if ((err_code == NRF_SUCCESS) && (hvx_len != len))
		err_code = NRF_ERROR_DATA_SIZE;

	return err_code;
}

#pragma endregion ** BLE_Service_Def_t ***************************************************************




void StopAdvertising() {
	uint32_t err_code;
	err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_IDLE);
	APP_ERROR_CHECK(err_code);
}

ServiceMessages_t BLEManagerServiceDef::Init() const {
	using namespace seLib::ServiceModel;
	//StateRef().State.AssignImmediate(ServiceState_e::Idle);
	return ServiceModel::ServiceDef<BLEManagerServiceState_t>::Init();
	
	//if (!Init())
		//return ServiceMessages_t::SvcMsg_FaultGeneric;

	//return ServiceMessages_t::SvcMsg_OK;
}

ServiceMessages_t BLEManagerServiceDef::Update() const {
	using namespace seLib::ServiceModel;
	uint32_t err_code;

	auto& state = StateRef().State;
	auto const & periph_state = BLE_Active_Peripheral->GetState();

	if (state.IsTransition(ServiceState_e::Idle, ServiceState_e::Running)) {
		BLE_Active_Peripheral->Init();
		//if (!Start())
			//return ServiceMessages_t::SvcMsg_FaultGeneric;
		if (BLE_Active_Peripheral->GetState()->Flags[BLEStatusFlags::AdvertisingEnabled]) {
			if (BLE_Active_Peripheral->adv_fast_enabled && m_advertising.adv_mode_current != BLE_ADV_MODE_FAST) {
				err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
				APP_ERROR_CHECK(err_code);
			} else if (BLE_Active_Peripheral->adv_slow_enabled && m_advertising.adv_mode_current != BLE_ADV_MODE_SLOW) {
				err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_SLOW);
				APP_ERROR_CHECK(err_code);
			}
		}
		state.Update();
	}

	if (state.IsTransition(ServiceState_e::Running, ServiceState_e::Idle)) {
		if (m_advertising.adv_mode_current != BLE_ADV_MODE_IDLE) {
			err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_IDLE);
			APP_ERROR_CHECK(err_code);
		}
		state.Update();
	}

	
	return ServiceMessages_t::SvcMsg_NoMoreTasks;
}


}
}
#endif // EnableModule_BLE
